Lecture24Nov.org
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
#+REVEAL_REVEAL_JS_VERSION: 4
#+OPTIONS: toc:nil

#+TITLE: Combinatory Logic ≅ Lambda Calculus + Haskell
#+AUTHOR: Lucas Dutton

* Preliminaries

** Following along the presentation

You can download this presentation as an org-mode file,
along with all the source code here:

https://github.com/Necried/CAS701-Lecture-HaskCombs

** Installing GHC

If you want to play around with the Haskell code, you need
the Glasgow Haskell Compiler (GHC). Just go to this site

https://www.haskell.org/ghcup/

and it has all the instructions you need based on your OS.

* Combinatory Logic with Haskell

** SKI Introduction
Let's encode the SKI combinators as "normal" functions in Haskell:

#+BEGIN_SRC haskell :tangle Combinators.hs
module Combinators where

s :: (a -> b -> c) -> (a -> b) -> a -> c
s x y z = x z (y z)

k :: a -> b -> a
k x y = x

i :: a -> a
i x = x
#+END_SRC

** What type of language is haskell?
Haskell is:
- Pure, no side effects when executing code
- Strongly typed - each term and function has a type
- Lazy - only evaluate things as necessary

** Building an SKI combinator evaluator

*** Defining Data Type
We don't usually use the combinators above in everyday programming
(although the K and I combinators are defined in the standard library
under different names).

Let's try and build a new data type for the SKI combinators instead:

#+REVEAL: split

_The file is ~CombinatorsData.hs~_
#+BEGIN_SRC haskell :tangle CombinatorsData.hs
module CombinatorsData where

type Name = String -- This just type aliases Name to String

data SKI =
    I
  | K
  | S
  | SVar Name  -- in OCaml, this is like ~Var of Name~
  | T SKI SKI -- in OCaml, this is like ~T of SKI*SKI~
  | SLit Int   -- We'll use this later...
  deriving (Eq)
#+END_SRC

The last definition, ~T SKI SKI~, acts like brackets, e.g. ~T x y ⇒ (x y)~

*** Evaluator and pretty printer
We can define a simple evaluator:

#+BEGIN_SRC haskell :tangle CombinatorsData.hs
eval :: SKI -> SKI
eval (T I x) = eval x -- I x = x
eval (T (T K x) y) = eval x -- K x y = x
eval (T (T (T S x) y) z) = eval $ T ((T x z)) ((T y z)) -- S x y z = x z (y z)
eval (T x y) = T (eval x) (eval y) -- If we have (x y), evaluate x and y
eval (SVar name) = SVar name -- We don't have to evaluate variables
eval p = error $ "pattern failed to evaluate: " <> show p
#+END_SRC

And also a simple "pretty" printer:

#+BEGIN_SRC haskell :tangle CombinatorsData.hs
instance Show SKI where
  show I = "I"
  show K = "K"
  show S = "S"
  show (SVar x) = x
  show (T x y) = "(" <> show x <> show y <> ")"
  show (SLit i) = "(" <> show i <> ")"
#+END_SRC

*** Test code
Now let's show that ~SKKx~ is equal to ~x~
#+BEGIN_SRC haskell :tangle CombinatorsData.hs
skkx = (T (T (T S K) K) (SVar "x")) -- (((S K) K) x)
print_skkx = print skkx
eval_skkx = eval skkx
#+END_SRC

