Lecture24Nov.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Combinatory Logic ≅ Lambda Calculus + Haskell</title>
<meta name="author" content="(Lucas Dutton)"/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/theme/black.css" id="theme"/>

</head>
<body>
<div class="reveal">
<div class="slides">

<section>
<section id="slide-org11ddd59">
<h2 id="org11ddd59"><span class="section-number-2">1.</span> Preliminaries</h2>
<div class="outline-text-2" id="text-1">
</div>
</section>
<section id="slide-orgd9122dc">
<h3 id="orgd9122dc"><span class="section-number-3">1.1.</span> Following along the presentation</h3>
<p>
You can download this presentation as an org-mode file,
along with all the source code here:
</p>

<p>
<a href="https://github.com/Necried/CAS701-Lecture-HaskCombs">https://github.com/Necried/CAS701-Lecture-HaskCombs</a>
</p>

</section>
<section id="slide-org7225ae6">
<h3 id="org7225ae6"><span class="section-number-3">1.2.</span> Installing GHC</h3>
<p>
If you want to play around with the Haskell code, you need
the Glasgow Haskell Compiler (GHC). Just go to this site
</p>

<p>
<a href="https://www.haskell.org/ghcup/">https://www.haskell.org/ghcup/</a>
</p>

<p>
and it has all the instructions you need based on your OS.
</p>

</section>
</section>
<section>
<section id="slide-org9621bd4">
<h2 id="org9621bd4"><span class="section-number-2">2.</span> Combinatory Logic with Haskell</h2>
<div class="outline-text-2" id="text-2">
</div>
</section>
<section id="slide-orgaf2c5b3">
<h3 id="orgaf2c5b3"><span class="section-number-3">2.1.</span> SKI Introduction</h3>
<p>
Let's encode the SKI combinators as "normal" functions in Haskell:
</p>

<div class="org-src-container">

<pre  class="src src-haskell" ><code trim><span style="color: #FF5E5E;">module</span> <span style="color: #E9FDAC;">Combinators</span> <span style="color: #FF5E5E;">where</span>

<span style="color: #8CDAFF;">s</span> <span style="color: #E9FDAC;">::</span> <span style="color: #C586C0;">(</span>a <span style="color: #E9FDAC;">-&gt;</span> b <span style="color: #E9FDAC;">-&gt;</span> c<span style="color: #C586C0;">)</span> <span style="color: #E9FDAC;">-&gt;</span> <span style="color: #C586C0;">(</span>a <span style="color: #E9FDAC;">-&gt;</span> b<span style="color: #C586C0;">)</span> <span style="color: #E9FDAC;">-&gt;</span> a <span style="color: #E9FDAC;">-&gt;</span> c
<span style="color: #8CDAFF;">s</span> x y z <span style="color: #E9FDAC;">=</span> x z <span style="color: #C586C0;">(</span>y z<span style="color: #C586C0;">)</span>

<span style="color: #8CDAFF;">k</span> <span style="color: #E9FDAC;">::</span> a <span style="color: #E9FDAC;">-&gt;</span> b <span style="color: #E9FDAC;">-&gt;</span> a
<span style="color: #8CDAFF;">k</span> x y <span style="color: #E9FDAC;">=</span> x

<span style="color: #8CDAFF;">i</span> <span style="color: #E9FDAC;">::</span> a <span style="color: #E9FDAC;">-&gt;</span> a
<span style="color: #8CDAFF;">i</span> x <span style="color: #E9FDAC;">=</span> x
</code></pre>
</div>

</section>
<section id="slide-orgef9a302">
<h3 id="orgef9a302"><span class="section-number-3">2.2.</span> What type of language is haskell?</h3>
<p>
Haskell is:
</p>
<ul>
<li>Pure, no side effects when executing code</li>
<li>Strongly typed - each term and function has a type</li>
<li>Lazy - only evaluate things as necessary</li>

</ul>

</section>
<section id="slide-org8645a73">
<h3 id="org8645a73"><span class="section-number-3">2.3.</span> Building an SKI combinator evaluator</h3>
<div class="outline-text-3" id="text-2-3">
</div>
</section>
<section id="slide-orgc05c519">
<h4 id="orgc05c519"><span class="section-number-4">2.3.1.</span> Defining Data Type</h4>
<p>
We don't usually use the combinators above in everyday programming
(although the K and I combinators are defined in the standard library
under different names).
</p>

<p>
Let's try and build a new data type for the SKI combinators instead:
</p>

</section>
<section id="slide-orgc05c519-split">

<p>
<span class="underline">The file is <code>CombinatorsData.hs</code></span>
</p>
<div class="org-src-container">

<pre  class="src src-haskell" ><code trim><span style="color: #FF5E5E;">module</span> <span style="color: #E9FDAC;">CombinatorsData</span> <span style="color: #FF5E5E;">where</span>

<span style="color: #FF5E5E;">type</span> <span style="color: #E9FDAC;">Name</span> <span style="color: #E9FDAC;">=</span> <span style="color: #E9FDAC;">String</span> <span style="color: #6D6D6D;">-- </span><span style="color: #6D6D6D;">This just type aliases Name to String</span>

<span style="color: #FF5E5E;">data</span> <span style="color: #E9FDAC;">SKI</span> <span style="color: #E9FDAC;">=</span>
    <span style="color: #E9FDAC;">I</span>
  <span style="color: #E9FDAC;">|</span> <span style="color: #E9FDAC;">K</span>
  <span style="color: #E9FDAC;">|</span> <span style="color: #E9FDAC;">S</span>
  <span style="color: #E9FDAC;">|</span> <span style="color: #E9FDAC;">SVar</span> <span style="color: #E9FDAC;">Name</span>  <span style="color: #6D6D6D;">-- </span><span style="color: #6D6D6D;">in OCaml, this is like ~Var of Name~</span>
  <span style="color: #E9FDAC;">|</span> <span style="color: #E9FDAC;">T</span> <span style="color: #E9FDAC;">SKI</span> <span style="color: #E9FDAC;">SKI</span> <span style="color: #6D6D6D;">-- </span><span style="color: #6D6D6D;">in OCaml, this is like ~T of SKI*SKI~</span>
  <span style="color: #E9FDAC;">|</span> <span style="color: #E9FDAC;">SLit</span> <span style="color: #E9FDAC;">Int</span>   <span style="color: #6D6D6D;">-- </span><span style="color: #6D6D6D;">We'll use this later...</span>
  <span style="color: #FF5E5E;">deriving</span> <span style="color: #C586C0;">(</span><span style="color: #E9FDAC;">Eq</span><span style="color: #C586C0;">)</span>
</code></pre>
</div>

<p>
The last definition, <code>T SKI SKI</code>, acts like brackets, e.g. <code>T x y ⇒ (x y)</code>
</p>

</section>
<section id="slide-orgbbfe4de">
<h4 id="orgbbfe4de"><span class="section-number-4">2.3.2.</span> Evaluator and pretty printer</h4>
<p>
We can define a simple evaluator:
</p>

<div class="org-src-container">

<pre  class="src src-haskell" ><code trim><span style="color: #8CDAFF;">eval</span> <span style="color: #E9FDAC;">::</span> <span style="color: #E9FDAC;">SKI</span> <span style="color: #E9FDAC;">-&gt;</span> <span style="color: #E9FDAC;">SKI</span>
<span style="color: #8CDAFF;">eval</span> <span style="color: #C586C0;">(</span><span style="color: #E9FDAC;">T</span> <span style="color: #E9FDAC;">I</span> x<span style="color: #C586C0;">)</span> <span style="color: #E9FDAC;">=</span> eval x <span style="color: #6D6D6D;">-- </span><span style="color: #6D6D6D;">I x = x</span>
<span style="color: #8CDAFF;">eval</span> <span style="color: #C586C0;">(</span><span style="color: #E9FDAC;">T</span> <span style="color: #FC9354;">(</span><span style="color: #E9FDAC;">T</span> <span style="color: #E9FDAC;">K</span> x<span style="color: #FC9354;">)</span> y<span style="color: #C586C0;">)</span> <span style="color: #E9FDAC;">=</span> eval x <span style="color: #6D6D6D;">-- </span><span style="color: #6D6D6D;">K x y = x</span>
<span style="color: #8CDAFF;">eval</span> <span style="color: #C586C0;">(</span><span style="color: #E9FDAC;">T</span> <span style="color: #FC9354;">(</span><span style="color: #E9FDAC;">T</span> <span style="color: #468800;">(</span><span style="color: #E9FDAC;">T</span> <span style="color: #E9FDAC;">S</span> x<span style="color: #468800;">)</span> y<span style="color: #FC9354;">)</span> z<span style="color: #C586C0;">)</span> <span style="color: #E9FDAC;">=</span> eval <span style="color: #E9FDAC;">$</span> <span style="color: #E9FDAC;">T</span> <span style="color: #C586C0;">(</span><span style="color: #FC9354;">(</span><span style="color: #E9FDAC;">T</span> x z<span style="color: #FC9354;">)</span><span style="color: #C586C0;">)</span> <span style="color: #C586C0;">(</span><span style="color: #FC9354;">(</span><span style="color: #E9FDAC;">T</span> y z<span style="color: #FC9354;">)</span><span style="color: #C586C0;">)</span> <span style="color: #6D6D6D;">-- </span><span style="color: #6D6D6D;">S x y z = x z (y z)</span>
<span style="color: #8CDAFF;">eval</span> <span style="color: #C586C0;">(</span><span style="color: #E9FDAC;">T</span> x y<span style="color: #C586C0;">)</span> <span style="color: #E9FDAC;">=</span> <span style="color: #E9FDAC;">T</span> <span style="color: #C586C0;">(</span>eval x<span style="color: #C586C0;">)</span> <span style="color: #C586C0;">(</span>eval y<span style="color: #C586C0;">)</span> <span style="color: #6D6D6D;">-- </span><span style="color: #6D6D6D;">If we have (x y), evaluate x and y</span>
<span style="color: #8CDAFF;">eval</span> <span style="color: #C586C0;">(</span><span style="color: #E9FDAC;">SVar</span> name<span style="color: #C586C0;">)</span> <span style="color: #E9FDAC;">=</span> <span style="color: #E9FDAC;">SVar</span> name <span style="color: #6D6D6D;">-- </span><span style="color: #6D6D6D;">We don't have to evaluate variables</span>
<span style="color: #8CDAFF;">eval</span> p <span style="color: #E9FDAC;">=</span> error <span style="color: #E9FDAC;">$</span> <span style="color: #FBE3BF;">"pattern failed to evaluate: "</span> <span style="color: #E9FDAC;">&lt;&gt;</span> show p
</code></pre>
</div>

<p>
And also a simple "pretty" printer:
</p>

<div class="org-src-container">

<pre  class="src src-haskell" ><code trim><span style="color: #FF5E5E;">instance</span> <span style="color: #E9FDAC;">Show</span> <span style="color: #E9FDAC;">SKI</span> <span style="color: #FF5E5E;">where</span>
  show <span style="color: #E9FDAC;">I</span> <span style="color: #E9FDAC;">=</span> <span style="color: #FBE3BF;">"I"</span>
  show <span style="color: #E9FDAC;">K</span> <span style="color: #E9FDAC;">=</span> <span style="color: #FBE3BF;">"K"</span>
  show <span style="color: #E9FDAC;">S</span> <span style="color: #E9FDAC;">=</span> <span style="color: #FBE3BF;">"S"</span>
  show <span style="color: #C586C0;">(</span><span style="color: #E9FDAC;">SVar</span> x<span style="color: #C586C0;">)</span> <span style="color: #E9FDAC;">=</span> x
  show <span style="color: #C586C0;">(</span><span style="color: #E9FDAC;">T</span> x y<span style="color: #C586C0;">)</span> <span style="color: #E9FDAC;">=</span> <span style="color: #FBE3BF;">"("</span> <span style="color: #E9FDAC;">&lt;&gt;</span> show x <span style="color: #E9FDAC;">&lt;&gt;</span> show y <span style="color: #E9FDAC;">&lt;&gt;</span> <span style="color: #FBE3BF;">")"</span>
  show <span style="color: #C586C0;">(</span><span style="color: #E9FDAC;">SLit</span> i<span style="color: #C586C0;">)</span> <span style="color: #E9FDAC;">=</span> <span style="color: #FBE3BF;">"("</span> <span style="color: #E9FDAC;">&lt;&gt;</span> show i <span style="color: #E9FDAC;">&lt;&gt;</span> <span style="color: #FBE3BF;">")"</span>
</code></pre>
</div>

</section>
<section id="slide-orgdc2fbe9">
<h4 id="orgdc2fbe9"><span class="section-number-4">2.3.3.</span> Test code</h4>
<p>
Now let's show that <code>SKKx</code> is equal to <code>x</code>
</p>
<div class="org-src-container">

<pre  class="src src-haskell" ><code trim><span style="color: #8CDAFF;">skkx</span> <span style="color: #E9FDAC;">=</span> <span style="color: #C586C0;">(</span><span style="color: #E9FDAC;">T</span> <span style="color: #FC9354;">(</span><span style="color: #E9FDAC;">T</span> <span style="color: #468800;">(</span><span style="color: #E9FDAC;">T</span> <span style="color: #E9FDAC;">S</span> <span style="color: #E9FDAC;">K</span><span style="color: #468800;">)</span> <span style="color: #E9FDAC;">K</span><span style="color: #FC9354;">)</span> <span style="color: #FC9354;">(</span><span style="color: #E9FDAC;">SVar</span> <span style="color: #FBE3BF;">"x"</span><span style="color: #FC9354;">)</span><span style="color: #C586C0;">)</span> <span style="color: #6D6D6D;">-- </span><span style="color: #6D6D6D;">(((S K) K) x)</span>
<span style="color: #8CDAFF;">print_skkx</span> <span style="color: #E9FDAC;">=</span> print skkx
<span style="color: #8CDAFF;">eval_skkx</span> <span style="color: #E9FDAC;">=</span> eval skkx
</code></pre>
</div>

</section>
</section>
