Lecture24Nov.org
* Lambda Calculus in Haskell

Let's now see Lambda Calculus in Haskell:

_The file is ~Lambda.hs~_
#+BEGIN_SRC haskell :tangle Lambda.hs
module Lambda where

type Name = String

data Expr
  = Var Name
  | App Expr Expr
  | Abs Name Expr
  | Lit Int
  | Op BinOp Expr Expr
  deriving (Show, Eq)
#+END_SRC

** Added niceties
With the ~Var~, ~App~ and ~Abs~ constructor we have a the complete
lambda calculus. But instead of encoding arithmetic with
the Church Numerals, I just hardcoded the arithmetic into the system.

(For more information on Church Numerals: https://en.wikipedia.org/wiki/Church_encoding)

#+REVEAL: split

We haven't defined our binary ops yet, they are just the normal arithmetic ones:

#+BEGIN_SRC haskell :tangle Lambda.hs
data BinOp
  = Plus
  | Minus
  | Mul
  | Div
  deriving (Show, Eq)
#+END_SRC

** Example expression

With this, we can now define a simple arithmetic expression:

~f x y = 3 * x + y~

Of course, this would be represented as

~λ x. λ y. + ((* 3 x)) y~

#+BEGIN_SRC haskell :tangle Lambda.hs
sample :: Expr
sample = Abs "x" (Abs "y"
  (Op Plus (Op Mul (Lit 3) (Var "x")) (Var "y")))
#+END_SRC

* Converting Lambda Terms into Combinatory Logic

Instead of creating an ~eval~ like we did for the SKI combinators for our lambda calculus,
why don't we convert our lambda term into an SKI equivalent and make use of the evaluator
there instead!

** Translation rules

Define ~T[]~ as our translation scheme that takes an arbitrary lambda calculi term
and converts it to an equivalent SKI combinator.

#+REVEAL: split
Then we define ~T[]~ as follows:

#+ATTR_REVEAL: :frag (appear)
1. $T[x] => x$
2. $T[(E₁ E₂)] => (T[E₁] T[E₂])$
3. $T[λx.E] => \textbf{K}\ (T[E])$ if ¬occurs(x, E)
4. $T[λx.x] => \textbf{I}$
5. $T[λx.λy.E] => T[λx.T[λy.E]]$ if occurs(x, E)
6. $T[λx.(E₁ E₂)] => \textbf{S}\ T[λx.E₁] T[λx.E₂]$ if occurs(x, E₁) and occurs(x, E₂)

** Coded in Haskell...

_This is now in ~Convert.hs~_
#+BEGIN_SRC haskell :tangle Convert.hs :exports none
module Convert where

import Lambda (Expr(..), BinOp(..), sample)
import CombinatorsData
#+END_SRC

- For ~Var~ and ~App~ those are just Rules 1, 2 respectively
- For ~Abs~, I make a separate function to deal with them
- Actually we deal with Rule 5 already here - ~abstract~ "flattens" all lambdas!
#+BEGIN_SRC haskell :tangle Convert.hs
translate :: Expr -> SKI
translate (Var x) = SVar x
translate (App e1 e2) = T (translate e1) (translate e2)
translate (Abs x e) = abstract x (translate e)
translate (Lit x) = SLit x
#+END_SRC

#+REVEAL: split

- If we have a function application, then we apply Rule 6
- If we have a variable equal to the function argument, that's Rule 4
- Otherwise, we just have Rule 3
#+BEGIN_SRC haskell :tangle Convert.hs
abstract :: Name -> SKI -> SKI
abstract x (T e1 e2) = combS (abstract x e1) (abstract x e2)
abstract x (SVar n) | x == n = I
abstract _ k = combK k

-- Show eta-reduction here...
combS :: SKI -> SKI -> SKI
combS f = T (T S f)

combK :: SKI -> SKI
combK = T K
#+END_SRC

