Lecture24Nov.html
<section>
<section id="slide-orgef99d0c">
<h2 id="orgef99d0c"><span class="section-number-2">3.</span> Lambda Calculus in Haskell</h2>
<p>
Let's now see Lambda Calculus in Haskell:
</p>

<p>
<span class="underline">The file is <code>Lambda.hs</code></span>
</p>
<div class="org-src-container">

<pre  class="src src-haskell" ><code trim><span style="color: #FF5E5E;">module</span> <span style="color: #E9FDAC;">Lambda</span> <span style="color: #FF5E5E;">where</span>

<span style="color: #FF5E5E;">type</span> <span style="color: #E9FDAC;">Name</span> <span style="color: #E9FDAC;">=</span> <span style="color: #E9FDAC;">String</span>

<span style="color: #FF5E5E;">data</span> <span style="color: #E9FDAC;">Expr</span>
  <span style="color: #E9FDAC;">=</span> <span style="color: #E9FDAC;">Var</span> <span style="color: #E9FDAC;">Name</span>
  <span style="color: #E9FDAC;">|</span> <span style="color: #E9FDAC;">App</span> <span style="color: #E9FDAC;">Expr</span> <span style="color: #E9FDAC;">Expr</span>
  <span style="color: #E9FDAC;">|</span> <span style="color: #E9FDAC;">Abs</span> <span style="color: #E9FDAC;">Name</span> <span style="color: #E9FDAC;">Expr</span>
  <span style="color: #E9FDAC;">|</span> <span style="color: #E9FDAC;">Lit</span> <span style="color: #E9FDAC;">Int</span>
  <span style="color: #E9FDAC;">|</span> <span style="color: #E9FDAC;">Op</span> <span style="color: #E9FDAC;">BinOp</span> <span style="color: #E9FDAC;">Expr</span> <span style="color: #E9FDAC;">Expr</span>
  <span style="color: #FF5E5E;">deriving</span> <span style="color: #C586C0;">(</span><span style="color: #E9FDAC;">Show</span>, <span style="color: #E9FDAC;">Eq</span><span style="color: #C586C0;">)</span>
</code></pre>
</div>

</section>
<section id="slide-orgc6b00d9">
<h3 id="orgc6b00d9"><span class="section-number-3">3.1.</span> Added niceties</h3>
<p>
With the <code>Var</code>, <code>App</code> and <code>Abs</code> constructor we have a the complete
lambda calculus. But instead of encoding arithmetic with
the Church Numerals, I just hardcoded the arithmetic into the system.
</p>

<p>
(For more information on Church Numerals: <a href="https://en.wikipedia.org/wiki/Church_encoding">https://en.wikipedia.org/wiki/Church_encoding</a>)
</p>

</section>
<section id="slide-orgc6b00d9-split">

<p>
We haven't defined our binary ops yet, they are just the normal arithmetic ones:
</p>

<div class="org-src-container">

<pre  class="src src-haskell" ><code trim><span style="color: #FF5E5E;">data</span> <span style="color: #E9FDAC;">BinOp</span>
  <span style="color: #E9FDAC;">=</span> <span style="color: #E9FDAC;">Plus</span>
  <span style="color: #E9FDAC;">|</span> <span style="color: #E9FDAC;">Minus</span>
  <span style="color: #E9FDAC;">|</span> <span style="color: #E9FDAC;">Mul</span>
  <span style="color: #E9FDAC;">|</span> <span style="color: #E9FDAC;">Div</span>
  <span style="color: #FF5E5E;">deriving</span> <span style="color: #C586C0;">(</span><span style="color: #E9FDAC;">Show</span>, <span style="color: #E9FDAC;">Eq</span><span style="color: #C586C0;">)</span>
</code></pre>
</div>

</section>
<section id="slide-org29dda87">
<h3 id="org29dda87"><span class="section-number-3">3.2.</span> Example expression</h3>
<p>
With this, we can now define a simple arithmetic expression:
</p>

<p>
<code>f x y = 3 * x + y</code>
</p>

<p>
Of course, this would be represented as
</p>

<p>
<code>λ x. λ y. + ((* 3 x)) y</code>
</p>

<div class="org-src-container">

<pre  class="src src-haskell" ><code trim><span style="color: #8CDAFF;">sample</span> <span style="color: #E9FDAC;">::</span> <span style="color: #E9FDAC;">Expr</span>
<span style="color: #8CDAFF;">sample</span> <span style="color: #E9FDAC;">=</span> <span style="color: #E9FDAC;">Abs</span> <span style="color: #FBE3BF;">"x"</span> <span style="color: #C586C0;">(</span><span style="color: #E9FDAC;">Abs</span> <span style="color: #FBE3BF;">"y"</span>
  <span style="color: #FC9354;">(</span><span style="color: #E9FDAC;">Op</span> <span style="color: #E9FDAC;">Plus</span> <span style="color: #468800;">(</span><span style="color: #E9FDAC;">Op</span> <span style="color: #E9FDAC;">Mul</span> <span style="color: #85DDFF;">(</span><span style="color: #E9FDAC;">Lit</span> <span style="color: #FC9354; font-weight: bold;">3</span><span style="color: #85DDFF;">)</span> <span style="color: #85DDFF;">(</span><span style="color: #E9FDAC;">Var</span> <span style="color: #FBE3BF;">"x"</span><span style="color: #85DDFF;">)</span><span style="color: #468800;">)</span> <span style="color: #468800;">(</span><span style="color: #E9FDAC;">Var</span> <span style="color: #FBE3BF;">"y"</span><span style="color: #468800;">)</span><span style="color: #FC9354;">)</span><span style="color: #C586C0;">)</span>
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-orgd539b79">
<h2 id="orgd539b79"><span class="section-number-2">4.</span> Converting Lambda Terms into Combinatory Logic</h2>
<p>
Instead of creating an <code>eval</code> like we did for the SKI combinators for our lambda calculus,
why don't we convert our lambda term into an SKI equivalent and make use of the evaluator
there instead!
</p>

</section>
<section id="slide-orgd7ea64a">
<h3 id="orgd7ea64a"><span class="section-number-3">4.1.</span> Translation rules</h3>
<p>
Define <code>T[]</code> as our translation scheme that takes an arbitrary lambda calculi term
and converts it to an equivalent SKI combinator.
</p>

</section>
<section id="slide-orgd7ea64a-split">
<p>
Then we define <code>T[]</code> as follows:
</p>

<ol>
<li class="fragment appear">\(T[x] => x\)</li>
<li class="fragment appear">\(T[(E₁ E₂)] => (T[E₁] T[E₂])\)</li>
<li class="fragment appear">\(T[λx.E] => \textbf{K}\ (T[E])\) if ¬occurs(x, E)</li>
<li class="fragment appear">\(T[λx.x] => \textbf{I}\)</li>
<li class="fragment appear">\(T[λx.λy.E] => T[λx.T[λy.E]]\) if occurs(x, E)</li>
<li class="fragment appear">\(T[λx.(E₁ E₂)] => \textbf{S}\ T[λx.E₁] T[λx.E₂]\) if occurs(x, E₁) and occurs(x, E₂)</li>

</ol>

</section>
<section id="slide-orgf9e119c">
<h3 id="orgf9e119c"><span class="section-number-3">4.2.</span> Coded in Haskell&#x2026;</h3>
<p>
<span class="underline">This is now in <code>Convert.hs</code></span>
</p>
<ul>
<li>For <code>Var</code> and <code>App</code> those are just Rules 1, 2 respectively</li>
<li>For <code>Abs</code>, I make a separate function to deal with them</li>
<li>Actually we deal with Rule 5 already here - <code>abstract</code> "flattens" all lambdas!</li>

</ul>
<div class="org-src-container">

<pre  class="src src-haskell" ><code trim><span style="color: #8CDAFF;">translate</span> <span style="color: #E9FDAC;">::</span> <span style="color: #E9FDAC;">Expr</span> <span style="color: #E9FDAC;">-&gt;</span> <span style="color: #E9FDAC;">SKI</span>
<span style="color: #8CDAFF;">translate</span> <span style="color: #C586C0;">(</span><span style="color: #E9FDAC;">Var</span> x<span style="color: #C586C0;">)</span> <span style="color: #E9FDAC;">=</span> <span style="color: #E9FDAC;">SVar</span> x
<span style="color: #8CDAFF;">translate</span> <span style="color: #C586C0;">(</span><span style="color: #E9FDAC;">App</span> e1 e2<span style="color: #C586C0;">)</span> <span style="color: #E9FDAC;">=</span> <span style="color: #E9FDAC;">T</span> <span style="color: #C586C0;">(</span>translate e1<span style="color: #C586C0;">)</span> <span style="color: #C586C0;">(</span>translate e2<span style="color: #C586C0;">)</span>
<span style="color: #8CDAFF;">translate</span> <span style="color: #C586C0;">(</span><span style="color: #E9FDAC;">Abs</span> x e<span style="color: #C586C0;">)</span> <span style="color: #E9FDAC;">=</span> abstract x <span style="color: #C586C0;">(</span>translate e<span style="color: #C586C0;">)</span>
<span style="color: #8CDAFF;">translate</span> <span style="color: #C586C0;">(</span><span style="color: #E9FDAC;">Lit</span> x<span style="color: #C586C0;">)</span> <span style="color: #E9FDAC;">=</span> <span style="color: #E9FDAC;">SLit</span> x
</code></pre>
</div>

</section>
<section id="slide-orgf9e119c-split">

<ul>
<li>If we have a function application, then we apply Rule 6</li>
<li>If we have a variable equal to the function argument, that's Rule 4</li>
<li>Otherwise, we just have Rule 3</li>

</ul>
<div class="org-src-container">

<pre  class="src src-haskell" ><code trim><span style="color: #8CDAFF;">abstract</span> <span style="color: #E9FDAC;">::</span> <span style="color: #E9FDAC;">Name</span> <span style="color: #E9FDAC;">-&gt;</span> <span style="color: #E9FDAC;">SKI</span> <span style="color: #E9FDAC;">-&gt;</span> <span style="color: #E9FDAC;">SKI</span>
<span style="color: #8CDAFF;">abstract</span> x <span style="color: #C586C0;">(</span><span style="color: #E9FDAC;">T</span> e1 e2<span style="color: #C586C0;">)</span> <span style="color: #E9FDAC;">=</span> combS <span style="color: #C586C0;">(</span>abstract x e1<span style="color: #C586C0;">)</span> <span style="color: #C586C0;">(</span>abstract x e2<span style="color: #C586C0;">)</span>
<span style="color: #8CDAFF;">abstract</span> x <span style="color: #C586C0;">(</span><span style="color: #E9FDAC;">SVar</span> n<span style="color: #C586C0;">)</span> <span style="color: #E9FDAC;">|</span> x <span style="color: #E9FDAC;">==</span> n <span style="color: #E9FDAC;">=</span> <span style="color: #E9FDAC;">I</span>
<span style="color: #8CDAFF;">abstract</span> <span style="color: #FF5E5E;">_</span> k <span style="color: #E9FDAC;">=</span> combK k

<span style="color: #6D6D6D;">-- </span><span style="color: #6D6D6D;">Show eta-reduction here...</span>
<span style="color: #8CDAFF;">combS</span> <span style="color: #E9FDAC;">::</span> <span style="color: #E9FDAC;">SKI</span> <span style="color: #E9FDAC;">-&gt;</span> <span style="color: #E9FDAC;">SKI</span> <span style="color: #E9FDAC;">-&gt;</span> <span style="color: #E9FDAC;">SKI</span>
<span style="color: #8CDAFF;">combS</span> f <span style="color: #E9FDAC;">=</span> <span style="color: #E9FDAC;">T</span> <span style="color: #C586C0;">(</span><span style="color: #E9FDAC;">T</span> <span style="color: #E9FDAC;">S</span> f<span style="color: #C586C0;">)</span>

<span style="color: #8CDAFF;">combK</span> <span style="color: #E9FDAC;">::</span> <span style="color: #E9FDAC;">SKI</span> <span style="color: #E9FDAC;">-&gt;</span> <span style="color: #E9FDAC;">SKI</span>
<span style="color: #8CDAFF;">combK</span> <span style="color: #E9FDAC;">=</span> <span style="color: #E9FDAC;">T</span> <span style="color: #E9FDAC;">K</span>
</code></pre>
</div>

</section>
